# coding: utf-8

import numpy as np
import pandas as pd

# 1. label_clean
def label_clean(x):
    x = str(x)
    if '-' in x and x[0] == '-':  # -1.22  -0.12  -0.06
        return x[1:]
    if '+' in x:
        i = x.index('+')  # 16.04++
        return x[0:i]
    if '>' in x and x[0] == '>':  # >11.00
        return x[1:]
    if len(x.split(sep='.')) > 2:  # 2.2.8
        i = x.rindex('.')
        return x[0:i] + x[i + 1:]
    if '7.75轻度乳糜' in x:  # 7.75轻度乳糜
        return x[0:4]
    if x == '0' or x == '974' or x == '100164':  # 提前处理异常值
        return np.nan
    if '未做' in x or '未查' in x or '弃查' in x or '异常值' in x:
        return np.nan
    return x


def data_clean(df):
    for c in ['收缩压', '舒张压', '血清甘油三酯', '血清高密度脂蛋白', '血清低密度脂蛋白']:
        df[c] = df[c].apply(label_clean)
        df[c] = df[c].astype(float)
    return df


# 2. feature extracted
def str_to_float(df):
    fl_col = []
    str_col= []
    for c in df.columns:
        try:
            df[c] = df[c].astype('float64')
            fl_col.append(c)
        except:
            str_col.append(c)
    return fl_col,str_col


def clean_symbol(x):
    x = str(x)
    if '<' in x and x[0]=='<':
        return x[1:]
    if '>' in x and x[0]=='>':
        return x[1:]
    if '＜' in x and x[0]=='＜':
        return x[1:]
    if '＞' in x and x[0] == '＞':
        return x[1:]
    if '.' in x and x[-1]=='.':
        return x[:-1]
    if '.' in x and x[0] == '.':
        return x[1:]
    return x

def str_mapping():
    mapping_to_nan = {
        '未查': np.nan,
        '弃查': np.nan,
        '未做': np.nan,
        '未检': np.nan,
        '自述不查': np.nan,
        '详见纸质报告': np.nan,
        '详见报告': np.nan,
        '详见报告。': np.nan,
        '详见报告单': np.nan,
        '详见图文报告': np.nan,
        '详见纸质报告单': np.nan,
        '详见纸质报告 详见纸质报告': np.nan,
        '详见报告单。': np.nan,
        '见纸质报告单': np.nan,
        '见报告单': np.nan,
        '见图文报告': np.nan,
        '详见报告单 详见报告单': np.nan,
        '详见检验单': np.nan,
        '标本已退检': np.nan,
        '具体内容请见分析报告。': np.nan,
        '详见医生诊疗。': np.nan,
        '详见中医养生报告': np.nan,
    }

    mapping_to_neg = {
        '-': 0,
        '--': 0,
        '- -': 0,
        '---': np.nan,
        '----': np.nan,
        '-----': np.nan,
        '阴性': 0,
        ' 阴性': 0,
        '阴性（-）': 0,
        '阴性(-)': 0,
        '阴性 阴性': 0,
        '阴性 -': 0,
        '- 阴性': 0,

        '正常': 0,
        '正常 正常': 0,
        '未见异常': 0,
        '未见明显异常': 0,
        '未发现异常': 0,
        '未见异': 0,
        '未检出': 0,
        '未见': 0,
        '无': 0,
    }

    mapping_to_pos = {     # need process later
        '+': 1,
        '阳性': 1,
        '阳性(+)': 1,
        '阳性(低水平)': 1,
        '阳性(1+)': 1,
        '阳性（+）': 1,
        '阳性(轻度)': 1,
        '阳性(中度)': 2,
        '阳性(重度)': 3,

        '++': 2,
        '+++': 3,
        '++++': 4,
        '＋': 1,
        '＋＋': 2,
        '＋＋＋': 3,

        '弱阳性': 0.5,
        '弱阳': 0.5, 
        '弱阳性(±)': 0.5,

        '+-': 0.5,
        '阴阳': 0.5,

    }

    mapping_to_right = {
        '---': np.nan,          #100006
        '16.2-': 16.2,

        '>100.00': 100,         #100014
        '20.908.': 20.908,

        '-1799.76': np.nan,     #10004
        '.3.70': 3.70,
        '4.14.': 4.14,

        '4.3.': 4.3,            #10009

        '<2.00': 2.00,           #10013

        '1..75': 1.75,
        '1.81.': 1.81,          #1106

        '-0.3': 0.3,            #1110
        '-0.1': 0.1,
        '<1.0': 0.9,

        '5.96%': 5.96,          #1112
        '6.00%': 6.00,

        '1..27': 1.27,          #1171

                                #1363
                                #139

        '0.07(utU/ml': 0.017,   #155
        '0.68S': 0.68,

        'CLT1D': np.nan,        #1815

        '77..21': 77.21,        #183

                                #1840

        '3。89': 3.89,          #1850

                                #1873

        '降脂后复查': np.nan,     #191

        '12.01.': 12.01,        #192
        '16.7.07': 16.7,

        '5..0': 5.0,            #2333

        '2.792.20': 2.792,      #2372

        '57142': np.nan,         #2403

        '21507': np.nan,        #2405

        '-90': 90,              #2406

                                #2409

        '3.0.0': 30.0,          #2410

                                #2413

        '14.4.': 14.4,          #269003

        '126.0.': 126.0,        #269006

        '116.0.': 116.0,        #269012

        '6.31.0.45': 6.31,      #300013
        '/': np.nan,

        '阴性1.496': 1.496,      #300017

        '0.00-25.00': 12.5,     #30007

        # 1869  13789           #300073

        '女性肿瘤指标': np.nan,    #300076

        ',5.00': 5.00,           #300134
        '< 28.0': 28.0,

        '189 脂血': 189,          #313


    }

    mapping_to_label ={
        
        'Ⅰ': 1,
        'Ⅱ': 2,
        'Ⅲ': 3,
        'Ⅳ': 4,

        '1+': 1,
        '+1': 1,
        '3+': 3,
        '2+': 2,

        '5级': 5,
        '4级': 4,
        '3级': 3,
        '2级': 2,
        '1级': 1,
        '0级': 0,
        
        '未及': 0,
        '少许': 0.5,
        '少': 0.5,
        '少量': 0.5,
        '少见': 0.5,
        '中量': 1,
        '多见': 2,
        '异常': 2,

        'yellow': 1,
        '黄色': 1,
        '淡黄色': 2,
        '浅黄色': 2,
        '褐色': 3,
        '黄褐色': 4,
        '深黄色': 4,
        '黄棕色': 5,
        '白浊': 6,
        '黑色': 7,
        '淡红色': 8,
        '暗红色': 9,
        '红色': 8,
        '无色': 10,
        '其他': 11,

        '透明': 0,
        '混浊': 1,
        '浑浊': 1,

        '软': 1,
        '软,糊状': 2,
        '半稀便': 3,
        '稀': 4,
        '中': 5,
        '硬': 6,
   
        '查见': 1,

    }

    return mapping_to_nan, mapping_to_neg, mapping_to_pos, mapping_to_right, mapping_to_label


